Revit 2027 API
PolymeshTopology.GetUV Method
 Returns one UV coordinate at the given index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV GetUV(
	int idx
)
Public Function GetUV (
	idx As Integer
) As UV
public:
UV^ GetUV(
	int idx
)
member GetUV :
        idx : int -> UV
Parameters
idx Int32
 A zero-based index of a UV coordinate
Return Value
UV
 UV coordinates at the given index
Exceptions
Exception | Condition
ArgumentException |  The given value is not a valid index of a UV coordinate of the polymesh. A valid valure is not negative and is smaller than the number of UV coordinates in the polymesh.
See Also
Reference
PolymeshTopology Class
Autodesk.Revit.DB Namespace